* IN-PROGRESS get close to Lem-in [0/3]                             :lem_in:
DEADLINE: <2019-11-13 Wed> SCHEDULED: <2019-10-01 Tue 00:00>

- State "IN-PROGRESS" from "PENDING"    [2019-10-28 Mon 23:13]
- State "PENDING"    from "IN-PROGRESS" [2019-10-15 Tue 00:11]
- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 06:05]

DEADLINE: <2019-10-27 Wed>

I must do something!! Graphs are l9wada! but first ,I have to finish the following

+ [-] checker
+ [ ] push_swap
+ [ ] visualizer

* IN-PROGRESS checker [1/2]                                              :ps:
SCHEDULED: <2019-10-27 Sun> DEADLINE: <2019-11-01 Fri>

- State "IN-PROGRESS" from "DONE"       [2019-10-28 Mon 23:12]
- State "DONE"       from "IN-PROGRESS" [2019-10-13 Sun 22:52]

:PROPERTIES:
:Effort:   25:00
:END:
:LOGBOOK:
CLOCK: [2019-10-29 Tue 00:57]--[2019-10-29 Tue 01:01] =>  0:04
CLOCK: [2019-10-29 Tue 00:56]--[2019-10-29 Tue 00:57] =>  0:01
CLOCK: [2019-10-13 Sun 18:51]--[2019-10-14 Mon 00:56] =>  6:05
CLOCK: [2019-10-09 Wed 18:03]--[2019-10-09 Wed 18:15] =>  0:12
CLOCK: [2019-10-08 Tue 02:38]--[2019-10-08 Tue 05:48] =>  3:10
CLOCK: [2019-10-08 Tue 01:21]--[2019-10-08 Tue 01:46] =>  0:25
CLOCK: [2019-10-08 Tue 00:40]--[2019-10-08 Tue 01:21] =>  0:41
CLOCK: [2019-10-03 Thu 22:03]--[2019-10-04 Fri 00:40] =>  2:37
CLOCK: [2019-10-03 Thu 03:51]--[2019-10-03 Thu 11:35] =>  7:44
CLOCK: [2019-10-03 Thu 03:47]--[2019-10-03 Thu 03:51] =>  0:04
:END:


I need to work at least 8hrs/day on this so that O can finish it once and for all

- [X] write the core operation
- [X] build a simple instruction input system
- [ ] fix the bug of applying operations
- [ ] test +the algorithm+ some input
- [ ] verify all possible inputs

** IN-PROGRESS apply ops
DEADLINE: <2019-10-31 Thu> SCHEDULED: <2019-10-29 Tue>
:PROPERTIES:
:Effort:   5h
:END:
:LOGBOOK:
CLOCK: [2019-10-29 Tue 01:02]
CLOCK: [2019-10-29 Tue 01:01]--[2019-10-29 Tue 01:02] =>  0:01
CLOCK: [2019-10-29 Tue 01:01]--[2019-10-29 Tue 01:01] =>  0:00
:END:
- State "IN-PROGRESS" from "TODO"       [2019-10-29 Tue 01:00]

This should not be that hard! there's a bug somewhere. And I have to find it! *Tonight!*
** DONE import libft from gitlab
DEADLINE: <2019-10-03 Thu 00:00>

- State "DONE"       from "IN-PROGRESS" [2019-10-03 Thu 22:03]
- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 17:44]

need to fix some errors of making before setting this to DONE! <2019-10-03 Thu 00:52> now I'm working on the checker!

* IN-PROGRESS OMG! push_swap [1/3]                                      :ps:
DEADLINE: <2019-11-10 Sun> SCHEDULED: <2019-10-06 Sun 09:00>

- State "IN-PROGRESS" from "PENDING"    [2019-10-28 Mon 23:13]
- State "PENDING"    from "TODO"       [2019-10-15 Tue 00:11]
- State "PENDING"    from "TODO"       [2019-10-02 Wed 07:20]
- State "PENDING"    from "IN-PROGRESS" [2019-10-02 Wed 06:02]
- State "IN-PROGRESS" from "TODO"       [2019-10-02 Wed 06:00]

DEADLINE: <2019-10-15 Tue 00:00>
SCHEDULED: <2019-10-07 Mon 09:00>

Jalal's idea seems good, I'll see what I can do with it:

#+begin_quote
it said that I need to find the mids, and then push to stack B. After that, retrieve elements from stack B applying the same operation but in reverse.

/NOTE/: the miss leading that I have is *how to sort when getting things back*
#+end_quote

- [X] document on the algos
  - [X] QuickSort
  - [X] MergeSort
  - [X] +BlockSort+
- [ ] write a detailed version of it
- [ ] implement it from /bottom to top/

* PENDING DOPAMINE! visualizer!!                                  :optional:
DEADLINE: <2019-11-14 Thu> SCHEDULED: <2019-10-16 Wed>

- State "PENDING"    from "TODO"       [2019-10-02 Wed 06:00]
